%function P3jia8B4
% P3+{la1^2la2la4,la1^2la3la4,la1la2^2la3,la1la2^2la4,la2la3^2la4,la1la2la3^2,la1la3la4^2,la2la3la4^2}下
%在面上二阶矩,体上一阶矩下的唯一性
%2019.6.20
clear
%format rat
%%
alpha=Duoxiangs3(3);
%alphao = [2,1,0,1;2,0,1,1;0,2,1,1;1,2,1,0;0,1,2,1;1,1,2,0;1,1,0,2;1,0,1,2];
  alphao = [2,1,0,1;2,0,1,1;1,2,1,0;1,2,0,1;0,1,2,1;1,1,2,0;1,0,1,2;0,1,1,2];
betaF=[2,0,0;0,2,0;0,0,2;1,1,0;1,0,1;0,1,1];
betaT=Duoxiangs3(1);

alpha = [alpha;alphao];
EF = shengchengMian(alpha,betaF);
ET = shengchengTi(alpha,betaT);

E = [EF;ET];

rank(E)

G = inv(E);

for i = 1:28
    for j = 1:28
%         if abs(G(i,j))<1e-10
%             G(i,j) = 0;
%         end
     G(i,j) = round(G(i,j));
    end
end


if norm(G*E-eye(28))>1e-13
    stop;
end

%%计算基函数g,及其导数 Dg
%alpha = [Duoxiangs3(3);alphao];

 syms la1 la2 la3 la4  real;
s = [la1 la2 la3 la4];
f = prod(power(s,alpha),2);
f = f';
g = f*G;
g = g';




syms Da1 Da2 Da3 Da4 Dpo real;
S = [Da1 Da2 Da3 Da4];
Df = zeros(28,1);
for j = 1:4
    alphas = alpha;
    alphas(:,j) = alphas(:,j)-1;
    Df = Df+alpha(:,j).*prod(power(s,alphas),2).*S(j);
end
 Df = Df';
 Dg = Df*G;
 Dg = Dg';
 
 
 
 

 
 
 
 
 
 
%%check the unislove
 
 
 
%  alpha = Duoxiangs2(3);
%  beta = Duoxiangs2(2);
%  
%  alpha = [alpha([1,7,10,5],:);[1,2,1;1,1,2];alpha([2,4,8,9,6,3],:)];
% % alpha = [;alpha([2,4,8,9,6,3],:);alpha([1,7,10,5],:);[1,2,1;1,1,2]];
%  
% n2 = size(alpha,1);
% n1 = size(beta,1);
% E=zeros(n1,n2);
% for g = 1:n1
%     for r = 1:n2
%         as = alpha(r,:)+beta(g,:);
%         E(g,r)=2*prod(factorial(as))/(factorial(sum(as)+2));
%     end
% end





% %% 唯一性证明 2020.9.16
% Ed12 = [0,0,4,-5,4,-5,0,0,0,0,10,10];
% Ed13 = [4,-5,0,0,4,-5,0,0,10,10,0,0];
% Ed14 = [4,-5,4,-5,0,0,10,10,0,0,0,0];
% 
% 
% Ed23 = [-5,4,0,0,10,10,0,0,4,-5,0,0];
% Ed24 = [-5,4,10,10,0,0,4,-5,0,0,0,0];
% Ed21 = [0,0,0,0,0,0,4,-5,4,-5,10,10];
% 
% Ed34 = [10,10,-5,4,0,0,-5,4,0,0,0,0];
% Ed31 = [0,0,0,0,0,0,-5,4,10,10,4,-5];
% Ed32 = [0,0,-5,4,10,10,0,0,0,0,4,-5];
% 
% Ed41 = [0,0,0,0,0,0,10,10,-5,4,-5,4];
% Ed42 = [0,0,10,10,-5,4,0,0,0,0,-5,4];
% Ed43 = [10,10,0,0,-5,4,0,0,-5,4,0,0];
% 
% 
% 
% Ed123 = 9*[68,68,68,68,0,0,-100,-100,0,0,0,0];
% Ed234 = 9*[0,0,0,0,0,0,68,68,68,68,-100,-100];
% Ed341 = 9*[0,0,68,68,-100,-100,0,0,0,0,68,68];
% Ed412 = 9*[-100,-100,0,0,68,68,0,0,68,68,0,0];
% 
% 
% Ed1223 = -27*56*[1,1,0,0,0,0,-1,-1,0,0,0,0];
% Ed1233 = -27*56*[0,0,1,1,0,0,-1,-1,0,0,0,0];
% 
% Ed2334 = -27*56*[0,0,0,0,0,0,1,1,0,0,-1,-1];
% Ed2344 = -27*56*[0,0,0,0,0,0,0,0,1,1,-1,-1];
% 
% 
% Ed3441 = -27*56*[0,0,0,0,-1,-1,0,0,0,0,1,1];
% Ed3411 = -27*56*[0,0,1,1,-1,-1,0,0,0,0,0,0];
% 
% Ed4112 = -27*56*[-1,-1,0,0,1,1,0,0,0,0,0,0];
% Ed4122 = -27*56*[-1,-1,0,0,0,0,0,0,1,1,0,0];
% 
% 
% 
% Eo = eye(12);
% Ec = [Ed12;Eo(1,:);Eo(3,:);Eo(5,:);Eo(2,:);Ed123;Ed412;Eo(4,:);Ed341;Eo(6,:);Ed23;...
%           Eo(7,:);Eo(9,:);Eo(8,:);Ed234;Eo(10,:);Ed34;Eo(11,:);Eo(12,:);Ed41;...
%           Ed4112;Ed3411;Ed1223;Ed4122;Ed2334;Ed1233;Ed3441;Ed2344];
% 
% 
% 
% 
% 
% 
% Es = [Ed13-Ed12;Ed14-Ed12;Ed24-Ed23;Ed21-Ed23;Ed31-Ed34;Ed32-Ed34;Ed42-Ed41;Ed43-Ed41];
% 
% Egc = [Es;ET*Ec];
% %%
